# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

# list_1 = [1, 2, 4, 0]
#
# result_1 = [i**2 for i in list_1]
#
# print (result_1)

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

#1
# a = {"яблоко", " арбуз", " банан", "apple"}
# b = {"apple", "melone", "banana", "яблоко"}
# new_list = b-a
# print ( new_list)
#2
# a = ["яблоко", " арбуз", " банан", "apple"]
# b = ["apple", "melone", "banana", "яблоко"]
#
# c = [a, b]
# result_2 = [ i for i in c if elem.

#3

# fruit_list = ["яблоко", " арбуз", " банан", "apple"]
# another_list = ["apple", "melone", "banana", "яблоко"]
# sort_list = list (set (fruit_list) & set (another_list))
# print(sort_list)

#4

# a = ["яблоко", " арбуз", " банан", "apple"]
# b = ["apple", "melone", "banana", "яблоко"]
# c =[]
#
# result_2 = [c.append for value in a  if a == b   c.join((list((filter(lambda x: x == value, b)))))]
# print(c)

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4

list_21 = [16, 2, 9, 4, 15]
list_1 = [ i for i in list_21 if i % 3 == 0 and i >=0 and i != 4]

print( list_1)

